Revit 2027 API
NumberingFormatSettings.GetParameters Method
 Get parameters incorporated into the numeric label.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<NumberingFormattedParameter> GetParameters()
Public Function GetParameters As IList(Of NumberingFormattedParameter)
public:
IList<NumberingFormattedParameter^>^ GetParameters()
member GetParameters : unit -> IList<NumberingFormattedParameter>
Return Value
IList<NumberingFormattedParameter>
See Also
Reference
NumberingFormatSettings Class
Autodesk.Revit.DB Namespace